tutorials/test1/0/air/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 292.15;

boundaryField
{

    air_to_porous
    {
        //type            zeroGradient;
        //value			uniform 320;
        type            turbulentFluidKappaOneCoupledBaffleMixed;
        //kappa           kappa;
        value           $internalField;
        Tnbr            T;
        solidKappa	 3.49;
    }
    air_to_porous_2
    {
        type            zeroGradient;
    }
    symm
    {
        type            symmetry;
    }
    inlet
    {
        type            fixedValue;
        value			uniform 304.15;
    }
    //#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
