tutorials/test1/0/air/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    air_to_porous
    {
        type            turbulentFluxCoupledBaffleMixedOnly1;
        value           $internalField;
        Tnbr            U;
    }
    air_to_porous_2
    {
        type            slip;
    }
    symm
    {
        type            symmetry;
    }
    inlet
    {
    	type			flowRateInletVelocity;
    	massFlowRate    0.1532;
    	rho				rho;
    	rhoInlet			1.29;
    }
    //#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
