tutorials/test1/0/air/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    air_to_porous
    {
        //type            compressible::alphatWallFunction;
        //value           uniform 0;
        type            calculated;
        value           uniform 0;
    }
    symm
    {
        type            symmetry;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
