tutorials/test1/0/air/p2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      p2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [2 -2 -4 0 0 0 0];

internalField   uniform 1e10;

boundaryField
{
    air_to_porous
    {
        type            calculated;
        value           $internalField;
    }
    
    symm
    {
        type            symmetry;
    }
    
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
