tutorials/test1/0/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   
    air_to_porous
    {
        type            fixedFluxPressure;//fixedValue;
        value           $internalField;
        //type            prghPressure;
        //p               $internalField;
        //value           $internalField;
    }
    
    symm
    {
        type            symmetry;
    }
    
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
