tutorials/test1/0/porous/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/porous";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 292.15;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value			uniform 292.15;
    }

    porous_to_air
    {
        //type            zeroGradient;
        type            turbulentSolidKappaOneCoupledBaffleMixed;
        //kappa           kappa;
        value           $internalField;
        Tnbr            T;
        solidKappa	 3.49;
    }
    channel
    {
        type            zeroGradient;
    }
    symm
    {
        type            symmetry;
    }
}


// ************************************************************************* //
