tutorials/test1/0/porous/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/porous";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    porous_to_air
    {
        type            zeroGradient;
        //type            turbulentVelocityCoupledBaffleMixed;
        //value           $internalField;
        //Tnbr            U;
    }
    channel
    {
        type            noSlip;
    }
    symm
    {
        type            symmetry;
    }
}


// ************************************************************************* //
