tutorials/test1/0/porous/p2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/porous";
    object      p2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [2 -2 -4 0 0 0 0];

internalField   uniform 1e10;

boundaryField
{
    outlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           $internalField;
    }

    porous_to_air
    {
        //type            fixedValue;
        //value           uniform 2e5;
        type            turbulentPressureCoupledBaffleMixedOnly1Cal;//compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        //kappa			kappa;
        Tnbr            p2;
    }
    channel
    {
        type            zeroGradient;
    }
    symm
    {
        type            symmetry;
    }
}


// ************************************************************************* //
