tutorials/test1/constant/porous/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

k0             2.2e-14;
Ef		0.005;
p0	     	1e5;             
nu		1e-5;
rho0		1.29;
Cp0		1005;
kappa0		0.026;
rho1		2700;
Cp1		794;
kappa1		2.721;	
molWeight	28.9;	
// ************************************************************************* //
