tutorials/test1/constant/porous/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/porous/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    channel
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          88;
        startFace       126388;
    }
    outlet
    {
        type            patch;
        nFaces          6624;
        startFace       126476;
    }
    symm
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          1628;
        startFace       133100;
    }
    porous_to_air
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          1828;
        startFace       134728;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_porous;
    }
)

// ************************************************************************* //
