tutorials/test1/system/air/probes1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points
(
    (-3 1 1)
    (3 1 1)    
);

fields  (p T rho);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
