tutorials/test1/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    cellSet;
        name    baoshi;
        source  zoneToCell;
        sourceInfo
        {
            name    baoshi;
        }
    }
    
    {
        action  new;
        type    cellSet;
        name    porous;
        source  zoneToCell;
        sourceInfo
        {
            name    porous;
        }
    }
);

// ************************************************************************* //
